backend/controllers/SiteController.php

SELECT COUNT(*) FROM `user` WHERE `role`='seller'
---
    public function actionIndex() {
        $totalMember = User::find()->where(['role'=>'member'])->count();
        $totalSeller = User::find()->where(['role'=>'seller'])->count();