backend/models/LoginForm.php

SELECT * FROM `user` WHERE ((`username`='admin') AND (`role`='admin')) OR ((`username`='admin') AND (`role`='superadmin'))
---
    protected function getUser() {
        if ($this->_user === null) {
            $this->_user = User::find()->where(['username' => $this->username, 'role' => 'admin'])->orWhere(['username' => $this->username, 'role' => 'superadmin'])->one();